# Напишите ваше решение

a, b, c = map(int, input("введите a,b,c через пробел").split())

print(min(a,b,c))