#Напишите ваше решение

time_ = int(input("введите время"))

total_time = time_ / 60 * 10

print(total_time)